// написать функцию, которая принимает строку в качестве параметра и выводит в консоль эту строку, окруженную одинарными кавычками

// написать функцию, которая принимает строку в качестве параметра и выводит в консоль эту строку, окруженную двойными кавычками

// написать функцию, которая принимает две строки в качестве параметров и выводит их в консоль, разделенными символом #

// написать функцию, которая принимает строку, число и строку в качестве параметров и выводит вторую строку, за которой следует первая строка, повторённая несколько раз (число повторений должно быть равно числовому аргументу)

// для каждой из вышеперечисленных функций написать альтернативный вариант, который заключается в следующем: вместо вывода текста в консоль, функция должно вернуть (return) строку, идентичную тексту, выводимому оригинальным вариантом функции(edited)