// написать функцию, которая принимает массив чисел в качестве аргумента и выводит в консоль каждый второй элемент входного массива

// написать функцию, которая принимает массив чисел в качестве аргумента и возвращает новый массив, содержащий каждый второй элемент исходного массива

// написать функцию, которая принимает числовой массив в качестве аргумента и удваивает каждый элемент массива. Функция не должна ничего возвращать (return). Должен измениться исходный массив.

// написать функцию, которая принимает числовой массив в качестве аргумента и удваивает каждый элемент массива. Функция должна вернуть новый массив, содержащий требуемые значения. Исходный массив должен остаться неизменным.

// написать функцию, которая принимает число в качестве аргумента и проверяет, является ли оно простым. Если является, возвращает true. Если не является, возвращает false. (Простые числа - это числа, которые не делятся без остатка ни на одно число кроме единицы и самого себя)

// написать функцию, которая принимает число в качестве аргумента и считает, сколько раз это число можно поделить пополам прежде чем оно станет меньше единицы. Например, для числа 3 результат выполнения функции должен быть равен числу 2, для чисда 5 - числу 3, для числа 8 - числу 4, для числа 9 - тоже числу 4.

// написать функцию (противоположность join'у), которая принимает строку и букву в качестве аргументов. Буквенный аргумент назовем разделителем. Функция должна разбить исходную строку на несколько строк по разделителю и вернуть массив, состоящий из этих строк. Например, для строки "123$asdf$45bb" и разделителя "$" функция должна вернуть массив ["123", "asdf", "45bb"]
